{ "items" : [ { "children" : [ { "children" : [ { "children" : [ { "children" : [  ],
                          "comment" : "I think for the purpose of teaching people the basics of programming it's perfectly acceptable to leave them with a basic understanding of \\\"You can only add numbers and strings.\\\" Then allow them to revisit the oddities much later after they have a much better understanding of what objects are. Honestly, I think it might be acceptable to just ask the student to explain to you how \\\"object addition\\\" would work. There are various ambiguous problems you could run into (concatenating two objects with the same property name but different values). I think this basic understanding is enough that even a novice would accept.__BR__I think things like dynamic \\\"this\\\" in javascript will be more confusing for newcomers. But, once you start talking about \\\"this\\\", you should probably already have the basics down.__BR__Edit:With all that said, I'm not saying Javascript is a great language to learn programming with. But I don't honestly know of a single language that I would be perfectly comfortable telling people to learn with. Most languages have their own quirks.",
                          "grayedOutPercent" : 0,
                          "id" : "4383349",
                          "reply_id" : "4383349&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "4 hours ago",
                          "username" : "Me1000"
                        },
                        { "children" : [ { "children" : [  ],
                                "comment" : "Type coercion is crazy, if for no reason other than making the behavior of certain code harder to predict. That said, I don't think it's a major stumbling block, and once you learn to avoid relying on it there's no problem.__BR__There are plenty of parts of JavaScript like that, but these gotchas are just red herrings. The core language is great.",
                                "grayedOutPercent" : 0,
                                "id" : "4383466",
                                "reply_id" : "4383466&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                                "time" : "3 hours ago",
                                "username" : "ehsanu1"
                              } ],
                          "comment" : "Tangent: to be clear, there is no difference between []+{} and {}+[] in javascript.__BR__var a = {} + [];__BR__var b = [] + {};__BR__var c = String({}) + String([])__BR__All three are equal. The order does matter in general because its doing string concatenation which obviously matters ([1] + [2] == \\\"12\\\"), but the fact that js always does string coercion and concatenation anytime you have + without numbers on both side isn't really that crazy.",
                          "grayedOutPercent" : 0,
                          "id" : "4383402",
                          "reply_id" : "4383402&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "4 hours ago",
                          "username" : "esrauch"
                        }
                      ],
                    "comment" : "Although I like Javascript and its tools have improved dramatically in the last few years, a number of cases (like [] + {} vs. {} + []) are decisively non-ideal for teaching people who are not somewhat versed in programming languages. It's this kind of thing which gave Javascript a reputation as a kind of client side PHP.__BR__I would be very happy if these kinds of irrationalities could be ironed out in a future version of the language, even if it meant backward incompatibility.__BR__If the language is thoroughly rationalized and there is a simple, beautiful API for graphics then I think it becomes the beginner's language to end all (since client-side web is such a nice platform to target). But for now, it isn't there... I'd be happy to hear that it was a priority.__BR__Perhaps something like Dart will pick up that quest.",
                    "grayedOutPercent" : 0,
                    "id" : "4382891",
                    "reply_id" : "4382891&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "6 hours ago",
                    "username" : "slurgfest"
                  } ],
              "comment" : "Javascript has its oddities for sure, but most of that lies in areas that you wouldn't need to touch while learning programming basics.__BR__Compared to my high school experience of learning in a C/C++ mismash with a teacher who insisted on introducing pointers very early, before ever presenting me with anything interesting to do which would make me want to figure out the details like that (and which scared me off programming for four years), I think it sounds like a dream.",
              "grayedOutPercent" : 0,
              "id" : "4382516",
              "reply_id" : "4382516&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "majormajor"
            },
            { "children" : [  ],
              "comment" : "Better Javascript on the browser with a simple, integrated, interactive canvas than Java, C#, or (god forbid) VB.Net on a complicated IDE!",
              "grayedOutPercent" : 0,
              "id" : "4383831",
              "reply_id" : "4383831&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "1 hour ago",
              "username" : "cs702"
            },
            { "children" : [ { "children" : [ { "children" : [  ],
                          "comment" : "You know, my mistake -- I somehow just skipped over the last line of your paragraph (\\\"it's scary to me...\\\").__BR__In that way, I certainly see what you're saying.  It'll be interesting to see what new problems emerge if this continues as a paradigm for teaching how to program.",
                          "grayedOutPercent" : 0,
                          "id" : "4383034",
                          "reply_id" : "4383034&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "5 hours ago",
                          "username" : "natural219"
                        } ],
                    "comment" : "&#62; I can't emphasize how much I disagree with you.__BR__I don't think you disagree with me at all... I said that javascript feels strange to me because I didn't start with it. I think it's a fine language to start people on, just an uncommon one that should yield interesting results.__BR__I certainly wouldn't suggest teaching with more \\\"rigid\\\" languages. I was trained on Java, and looking back I can see what a terrible way of doing things that is.__BR__FWIW though, it's been  my experience that for all but the most trivial tasks in Javascript, you quickly find yourself getting into somewhat advanced territory with e.g. scoping, closures, and anonymous functions. Again, I think these concepts are mostly weird to me just because they're different than what I personally was trained on, but they're certainly not as easy to grok as e.g. variable assignment and conditionals.",
                    "grayedOutPercent" : 0,
                    "id" : "4382987",
                    "reply_id" : "4382987&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "5 hours ago",
                    "username" : "powrtoch"
                  },
                  { "children" : [  ],
                    "comment" : "Likewise the emphasis! Although you're right that a lot of languages are bureaucratic with enigmatic exceptions and so on, I think that a well-typed language is better to learn to begin with than one which basically accepts whatever nonsense you throw at it. I'm not sure the perfect beginner's language exists, but I personally believe that if it did it would be statically typed.",
                    "grayedOutPercent" : 0,
                    "id" : "4382948",
                    "reply_id" : "4382948&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "6 hours ago",
                    "username" : "lubutu"
                  },
                  { "children" : [  ],
                    "comment" : "Strongly typed languages aren't good introductory languages, but that doesn't mean any language that isn't strongly types is a good introductory language.",
                    "grayedOutPercent" : 36,
                    "id" : "4383043",
                    "reply_id" : "4383043&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "5 hours ago",
                    "username" : "danielweber"
                  }
                ],
              "comment" : "I can't emphasize how much I disagree with you.  You can do an incredible amount with Javascript with very few symbols to learn up front.  If your goal is to get people interested in programming, there is nothing more discouraging than having to trudge through learning the intricacies of a relatively \\\"safe\\\" language with rigid types, inheritance models, and dozens of enigmatic exceptions.__BR__Notice that I'm not saying these things are bad, but they are certainly more than a beginner needs to learn basic syntax and become familiar with control flow.",
              "grayedOutPercent" : 0,
              "id" : "4382928",
              "reply_id" : "4382928&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "6 hours ago",
              "username" : "natural219"
            },
            { "children" : [  ],
              "comment" : "Agreed. I personally started in QBasic, so I guess where you start doesn't limit you for life, but these days I typically recommend Python as a first language.",
              "grayedOutPercent" : 0,
              "id" : "4382595",
              "reply_id" : "4382595&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "krschultz"
            },
            { "children" : [  ],
              "comment" : "So many people learned (a dialect of) BASIC despite it's faults because it was the one language available on nearly every home computer on the market, and typically accessible directly from the main UI of the computer. Considering how the browser may as well be \\\"the computer\\\" for many people, JS is in the same position.",
              "grayedOutPercent" : 0,
              "id" : "4384072",
              "reply_id" : "4384072&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "36 minutes ago",
              "username" : "ConstantineXVI"
            },
            { "children" : [  ],
              "comment" : "I learned javascript as my first language, and when I first saw recursion my reaction was \\\"There's a name for that?\\\".__BR__If you learn from good tutorials it can be as good as learning with scheme.",
              "grayedOutPercent" : 0,
              "id" : "4382642",
              "reply_id" : "4382642&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "rabidsnail"
            },
            { "children" : [  ],
              "comment" : "Not sure it matters really, since programming will \\\"speak\\\" to some people and not to others regardless of the language.__BR__But in terms of JavaScript specifically, I think first timers could do without being exposed to lexical scoping and truthiness.__BR__I like that Javascript gives you encapsulation without necessarily object orientation, which is probably a good place for beginning programmers to start.",
              "grayedOutPercent" : 0,
              "id" : "4383208",
              "reply_id" : "4383208&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "4 hours ago",
              "username" : "newobj"
            },
            { "children" : [  ],
              "comment" : "I learned javascript as my first language (well, I half learned Pascal first). It's not that bad.",
              "grayedOutPercent" : 0,
              "id" : "4383488",
              "reply_id" : "4383488&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "3 hours ago",
              "username" : "adrusi"
            }
          ],
        "comment" : "It's hard for me to imagine learning Javascript as your first programming language. It's always felt kind of crazy and bizarre to me (especially when you try to do anything requiring more than 20 lines of code), but I think a lot of that is just failure on my part to shake off the paradigms I'm used to. A generation of coders who are actually trained from the start to think in Javascript... almost scary honestly, but in a good way. We need more John Resigs pushing the web forward :-)",
        "grayedOutPercent" : 0,
        "id" : "4382483",
        "reply_id" : "4382483&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "7 hours ago",
        "username" : "powrtoch"
      },
      { "children" : [ { "children" : [ { "children" : [ { "children" : [  ],
                          "comment" : "Yes, but it's not possible to run Dr. Scheme in the browser. So there would still have to be a fair amount (ie almost all) of reinvention.",
                          "grayedOutPercent" : 0,
                          "id" : "4382857",
                          "reply_id" : "4382857&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "6 hours ago",
                          "username" : "rabidsnail"
                        } ],
                    "comment" : "It is possible to use Scheme in the browser too:__BR__    http://www.wescheme.org/",
                    "grayedOutPercent" : 0,
                    "id" : "4382751",
                    "reply_id" : "4382751&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "6 hours ago",
                    "username" : "soegaard"
                  } ],
              "comment" : "Having everything run in the browser is a _huge_ win, because it allows students to share what they've made with their friends. Post to facebook \\\"Look what I made\\\", which includes the source and makes it easy for others to modify it and share that themselves. Viral loop!",
              "grayedOutPercent" : 0,
              "id" : "4382457",
              "reply_id" : "4382457&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "rabidsnail"
            },
            { "children" : [ { "children" : [ { "children" : [  ],
                          "comment" : "It is pretty confusing -- maybe we should invent a new acronym for use on HN.__BR__&#62;_&#62;",
                          "grayedOutPercent" : 0,
                          "id" : "4383331",
                          "reply_id" : "4383331&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "4 hours ago",
                          "username" : "shardling"
                        } ],
                    "comment" : "Ah, so not National Institutes of Health. Makes more sense now",
                    "grayedOutPercent" : 0,
                    "id" : "4382587",
                    "reply_id" : "4382587&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "7 hours ago",
                    "username" : "jonahkagan"
                  } ],
              "comment" : "NIH = Not Invented Here, in case somebody else is wondering also.",
              "grayedOutPercent" : 0,
              "id" : "4382448",
              "reply_id" : "4382448&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "lacerus"
            }
          ],
        "comment" : "Some similarities with Felleisen's work teaching programming to early high schoolers,__BR__- http://www.programbydesign.org/__BR__Those folks have tons of data on what works, what doesn't.__BR__I get a bit of a NIH feeling from this effort, that I hope is unfounded.",
        "grayedOutPercent" : 0,
        "id" : "4382150",
        "reply_id" : "4382150&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "dons"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "&#62; Learning tools like this would have saved my teachers a lot of headaches if they were available 10 years ago.__BR__This type of teaching has a formal name. It's sometimes called course delivery reversal or course flipping, with the idea being that, essentially, the \\\"lecture\\\" is done outside of the class, and the \\\"homework\\\" is done within class. In this way, you can have a subject matter expert present at the time when he or she is actually needed.__BR__I've tried it in my own courses (recording in Camtasia and having students watch the lecture outside of class, where they can rewind, pause, etc.), then dedicating the entire class time to allow the students to actually work problems. More generally, active learning has been gaining popularity in the classroom.",
              "grayedOutPercent" : 0,
              "id" : "4383527",
              "reply_id" : "4383527&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "3 hours ago",
              "username" : "barik"
            },
            { "children" : [ { "children" : [  ],
                    "comment" : "Sounds like what is happening in the lower year levels these days.",
                    "grayedOutPercent" : 0,
                    "id" : "4383528",
                    "reply_id" : "4383528&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "3 hours ago",
                    "username" : "robryan"
                  } ],
              "comment" : "play with the subject matter during the lesson__BR__Kind of removes the need for a \\\"lesson\\\" and teacher, in favor of a facilitator that can go around and help those learning to discover things they hadn't considered.",
              "grayedOutPercent" : 0,
              "id" : "4382749",
              "reply_id" : "4382749&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "6 hours ago",
              "username" : "richcollins"
            }
          ],
        "comment" : "Learning tools like this would have saved my teachers a lot of headaches if they were available 10 years ago.__BR__As opposed to the classroom model of: [lecture -&#62; assign work -&#62; grade &#38; return with static feedback], students can actually play with the subject matter during the lesson, instead of turning pens into projectiles or doodling in their books because they're bored to death (not that I know anything about that). Then they get immediate feedback, whether right or wrong, by seeing how the instructor would have solved the problem. That kind of hands on learning, where the student learns through their own trials and errors is much more fun than sitting through a lecture that has to accomodate the varied learning paces of a classroom of 20+ students.__BR__The video posted here unfortunately focuses on the live editing aspect of the app, but you can see the interactive lesson function more  clearly in this early prototype video[1].__BR__This kind of interactive learning is the same thing that Sebastian Thrun is working on at Udacity[2]. For all the promise of making university courses available for free online, I think this is the truly disruptive stuff going on in online education, because it's way beyond just filming lectures and throwing them online, it's a fundamental leap forward for education.__BR__[1] http://www.youtube.com/watch?v=nvaaude_1hk[2] http://www.youtube.com/watch?v=75TP3hoPA8U",
        "grayedOutPercent" : 0,
        "id" : "4382658",
        "reply_id" : "4382658&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "7 hours ago",
        "username" : "thesash"
      },
      { "children" : [ { "children" : [ { "children" : [  ],
                    "comment" : "I had a programmer dad, and was homeschooled. The first thing he did when I asked how I could cheat at the various qbasic games we had (a la game genie) was hand me a Learn Qbasic book. He said I'd know how to cheat once I finished working my way through the book. Eventually I did learn how to cheat, but got bored with it. So I made them harder ;)__BR__Sorry yours wasn't the same!",
                    "grayedOutPercent" : 0,
                    "id" : "4384019",
                    "reply_id" : "4384019&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "52 minutes ago",
                    "username" : "warfangle"
                  },
                  { "children" : [  ],
                    "comment" : "I had a similar experience with a programmer Dad, so you're not alone.",
                    "grayedOutPercent" : 0,
                    "id" : "4383047",
                    "reply_id" : "4383047&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "5 hours ago",
                    "username" : "rhizome"
                  },
                  { "children" : [  ],
                    "comment" : "same",
                    "grayedOutPercent" : 0,
                    "id" : "4383109",
                    "reply_id" : "4383109&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "5 hours ago",
                    "username" : "thaumasiotes"
                  }
                ],
              "comment" : "Thank you for being willing to teach your son programming. I was homeschooled with a programmer for a dad and I guess it just never occurred to him to teach me himself. I discovered programming on my own in late high school, but I would have loved it when I was younger.",
              "grayedOutPercent" : 0,
              "id" : "4382412",
              "reply_id" : "4382412&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "8 hours ago",
              "username" : "archon"
            } ],
        "comment" : "Interesting. I have shown my son the Logo turtle, but hopefully this will make even more sense to him. I was looking for a way to expose him to Processing but unsure where to begin. It's obvious now.__BR__We are home schooling and always looking for new and interesting stuff to do with him.__BR__Thank you, John.",
        "grayedOutPercent" : 0,
        "id" : "4382199",
        "reply_id" : "4382199&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "msg"
      },
      { "children" : [  ],
        "comment" : "Don't miss the link to Bret Victor's lecture on responsive programming: http://vimeo.com/36579366 . I found it to be very enjoyable and it further shows what is possible with this paradigm. [minutes 2-23 are most interesting and relevant]",
        "grayedOutPercent" : 0,
        "id" : "4382423",
        "reply_id" : "4382423&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "karpathy"
      },
      { "children" : [  ],
        "comment" : "We are working on a similar project (programming education), but in a persistent and multiplayer environment. It&euro;&trade;s more like a live game framework which allows to learn JavaScript, or just to have fun!__BR__Everything is programmable: the display of a bot (Canvas 2D Context API), the buttons used to to control it, the interactions between the bots, etc.__BR__https://github.com/bpierre/modul.io",
        "grayedOutPercent" : 0,
        "id" : "4382184",
        "reply_id" : "4382184&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "bpierre"
      },
      { "children" : [  ],
        "comment" : "Probably like many others, I learned to program first by developing web applications. The mass of information and multiple moving pieces frustrated me almost to the point of quitting. There are probably many people who did quit when introduced to programming this way.__BR__This CS learning platform brings programming education back to its simple roots, back when your first program was as simple as drawing a circle in BASIC. It also leaps it forward, borrowing ideas from Bret Victors responsiveness talk was brilliant and I hope sets a precedent for programming education moving forward.__BR__I really admire what you've done, Mr. Resig and the Khan Academy team!",
        "grayedOutPercent" : 0,
        "id" : "4382851",
        "reply_id" : "4382851&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "6 hours ago",
        "username" : "hanibash"
      },
      { "children" : [  ],
        "comment" : "This is not unlike Bret Victor's work - http://vimeo.com/36579366 . Do watch the video, if you have an hour to spare, it's a beautiful demonstration of \\\"programming by tinkering.\\\"",
        "grayedOutPercent" : 0,
        "id" : "4383873",
        "reply_id" : "4383873&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "1 hour ago",
        "username" : "archivator"
      },
      { "children" : [  ],
        "comment" : "This is massively badass.  I think this may be the best tool out there for learning programming.__BR__One issue I am having here in Chrome in Ubuntu on my computer is that some of the videos are giving me minor playback problems where some visual features are not visible.  For example, in the intro to drawing tutorial the rectangle seems to turn into a line because three of the sides are not visible.  This is probably just what I get for using Linux though.__BR__Anyway, I was wondering: have Mr. Khan and the rest of them put any thought into how the new interactive programming environment might be applied to learning math or other concepts taught by Khan Academy besides Computer Science?  Like specifically taking some of the math or other lessons and presenting applications to tweak that would demonstrate those concepts.  Maybe lessons in those other areas could sometimes include a link to a programming experiment.__BR__Also, other question: are there any plans to try to cover a broader range of computer science or maybe even software engineering topics, for example things like Objects/Classes, components, unit testing, QA, feedback loops in general or for example between the developers/analysts and the users or between the developer and his test suite?",
        "grayedOutPercent" : 0,
        "id" : "4383007",
        "reply_id" : "4383007&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "5 hours ago",
        "username" : "ilaksh"
      },
      { "children" : [  ],
        "comment" : "This is very exciting.  I was just looking around this past weekend for a way to introduce my 10 and 13 year-olds to programming concepts.  I want them to understand more about the computer than how to play warcraft, watch youtube videos of pandas, or even make slide presentations.__BR__My one daughter is going into 8th grade and has had a total of two half-semesters of \\\"business and computer science\\\" where the most they do is to play around with PowerPoint and Excel.  Computers are so integral to every-day life now.  It's positively disgraceful that every child shouldn't be educated on what they are, how they're built, how they work, how to program them, etc.",
        "grayedOutPercent" : 0,
        "id" : "4382371",
        "reply_id" : "4382371&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "crusso"
      },
      { "children" : [  ],
        "comment" : "I think a small, beautiful detail lost here is John Resig's career path. As the creator of jQuery, he probably had his choice of which sexy SV start-up to go work at. He chose a non-profit that's aiming to fundamentally improve his country's education. Pretty admirable if you ask me, and perhaps more importantly, a slice of hope, that if one desires to, he or she can use his or her time to change the world for the better.",
        "grayedOutPercent" : 0,
        "id" : "4383788",
        "reply_id" : "4383788&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "2 hours ago",
        "username" : "scottrblock"
      },
      { "children" : [ { "children" : [ { "children" : [ { "children" : [ { "children" : [ { "children" : [  ],
                                      "comment" : "If it sounds like \\\"pot\\\", doesn't matter if he really said \\\"pie\\\"; chances are many kids are going to hear \\\"pot\\\" too unfortunately.",
                                      "grayedOutPercent" : 0,
                                      "id" : "4382807",
                                      "reply_id" : "4382807&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                                      "time" : "6 hours ago",
                                      "username" : "pitchups"
                                    } ],
                                "comment" : "Ok ok.. I still hear \\\"pot\\\".. but that's probably my \\\"New Yorker ears\\\" tuning.__BR__You are right though; since it's aimed at high school, I doubt it's pot. ;(",
                                "grayedOutPercent" : 0,
                                "id" : "4382572",
                                "reply_id" : "4382572&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                                "time" : "7 hours ago",
                                "username" : "crag"
                              } ],
                          "comment" : "I don't think it would be wise for a kids education site to reference pot.",
                          "grayedOutPercent" : 0,
                          "id" : "4382533",
                          "reply_id" : "4382533&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "7 hours ago",
                          "username" : "UK-AL"
                        } ],
                    "comment" : "You sure about that? I heard pot. Maybe I just \\\"wanted\\\" to hear pot. I'll listen again.",
                    "grayedOutPercent" : 0,
                    "id" : "4382521",
                    "reply_id" : "4382521&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "7 hours ago",
                    "username" : "crag"
                  },
                  { "children" : [  ],
                    "comment" : "Definitely pie. On Tau Day the Khan Academy office was graced with a wonderful tau (two pie).",
                    "grayedOutPercent" : 0,
                    "id" : "4382827",
                    "reply_id" : "4382827&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "6 hours ago",
                    "username" : "dylanvee"
                  }
                ],
              "comment" : "I believe she says \\\"pie\\\", and not \\\"pot\\\".",
              "grayedOutPercent" : 0,
              "id" : "4382517",
              "reply_id" : "4382517&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "rhc2104"
            } ],
        "comment" : "Best part of the intro video:__BR__\\\"Welcome. I'm super excited about computer science. it's my favoriate thing in the world... except for pot\\\".__BR__QFT.",
        "grayedOutPercent" : 0,
        "id" : "4382509",
        "reply_id" : "4382509&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "7 hours ago",
        "username" : "crag"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "Nothing matters more than ubiquity. Let mechannel the old Steve Ballmer for a moment:__BR__Ubiquity! Ubiquity! Ubiquity!__BR__I learned to program with BASIC in the 80s. Somehow I survived, though old-school BASIC was like a clay tablet compared to JS. (Get this: No functions, all global scope. It was like assembly language but with less power.)__BR__But BASIC was awesome because every microcomputer had it built in. Walk up to a machine and start typing BASIC. I must have typed in the same program 20 times.__BR__I remember spending 45 minutes with this random Wang terminal thing at the local library, trying to find BASIC. I never did, of course, so I remember concluding that it was probably broken. I'm still not sure I was wrong, exactly. ;)",
              "grayedOutPercent" : 0,
              "id" : "4383361",
              "reply_id" : "4383361&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "4 hours ago",
              "username" : "mechanical_fish"
            },
            { "children" : [  ],
              "comment" : "Hey - I'm one of the interns that worked on this.__BR__I have my own reservations about JavaScript the language, but after seeing what John had built when I started, I believe that this is undoubtedly the right way to go.__BR__If we wanted to use another language to accomplish similar goals, the options would be:__BR__1. Run the code on the server. This dramatically increases latency, introduces more security concerns and would dramatically increase our costs as this would inflate our server load dramatically. Really, its the latency here that makes this a no-go. As you use the number scrubber, it's re-executing several times a second, and that's just not going to work out with client-server communication (even with websockets).__BR__2. Run a different language that compiles to JS and runs in the browser. As it stands, the overhead of doing this is also too much. It would be shipping a compiler or parser down to every client. CoffeeScript may be the most reasonable option there, but it has many of the same warts as JavaScript anyway. Any parser/compiler needed introduces an extra step in the pipeline and would inevitably reduce responsiveness.__BR__While JavaScript the language certainly has its problems, it's what it lets you do that counts here.",
              "grayedOutPercent" : 0,
              "id" : "4382422",
              "reply_id" : "4382422&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "8 hours ago",
              "username" : "phleet"
            },
            { "children" : [ { "children" : [ { "children" : [ { "children" : [  ],
                                "comment" : "A prototypal language can easily simulate classical OOP. The converse is not true. Take a look at how CoffeeScript implements classes. There are also a plethora of libraries that provide various class/inheritance models, with whatever taste of complexity you'd like.__BR__You also want \\\"real typing\\\". Do you mean strong typing or static typing? In either case, the language will fight you all the way, being intrinsically weekly/dynamically typed, and so it is somewhat orthogonal to prototypes vs classical OOP.__BR__IMO, if you want to teach type theory, you ought to be doing it in a language like Haskell anyways. Which might not the best thing to expose an absolute beginner to. ;)",
                                "grayedOutPercent" : 0,
                                "id" : "4384038",
                                "reply_id" : "4384038&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                                "time" : "45 minutes ago",
                                "username" : "ehsanu1"
                              } ],
                          "comment" : "Thanks for the blog post, I hadn't seen that before. As I said before, these things are subjective. In my opinion, the prototype model is too far removed from the classical object model to ever teach effectively with it. Primarily, my dislike of it within a classroom comes from the fact that it demolishes any chance of real typing. I think this is a serious issue when teaching children, both from a pure CS stand point and from an engineering principles stand point. It may make life easier for some programmers, its quick and light, but for teaching I think its inappropriate. I don't believe that in using it, the student gains no real insight into either CS or engineering. That being said, I'm no prototyping expert, so any counter argument would be informative!",
                          "grayedOutPercent" : 0,
                          "id" : "4382943",
                          "reply_id" : "4382943&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "6 hours ago",
                          "username" : "joeroot"
                        } ],
                    "comment" : "You're right about some of the warts of javascript.   John specifically discusses these in a different blog post. http://ejohn.org/blog/javascript-as-a-first-language/__BR__Some of these warts are surprisingly easy to work around:  for instance, they always use \\\"===\\\" and don't even tell the student about \\\"==\\\" until much later.__BR__In other cases I just think you're wrong.  For instance, I think that the prototype system is simpler and easier to understand than classical objects, while at the same time being more powerful.",
                    "grayedOutPercent" : 0,
                    "id" : "4382872",
                    "reply_id" : "4382872&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "6 hours ago",
                    "username" : "bryanlarsen"
                  } ],
              "comment" : "The first language decision is always a tough one. Having spent the past few months teaching programming to school children part time, I found that you're often weighing up a number of considerations.__BR__1) You want a language/environment which encourages creativity and offers visual feedback as a reward. This is where Brett Victor's demonstration becomes remarkably powerful. Instant feedback is important not only for the creative process, but for maintaining interest. Some children will never enjoy programming, but for those who will, how can you excite them? Languages such as JavaScript can be a good tool for this. Children spend most of their time in an IT lesson playing web games when your back is turned. Teaching them how to make those games helps foster an interest, and JS is a good language for doing this.__BR__2) Do you want a language which teaches the basic building blocks of CS, or do you want a language which is of practical engineering benefit? You could argue that functional languages such as Haskell encourage children to really think about what computation is, or conversely you could propose that teaching JAVA prepares them better for the real world. Both have benefits, striking a balance is difficult. Deciding what's important can often be subjective: functional or OO, strongly or weakly typed, concurrent or not? There are so many factors at play that no-one will ever agree on a perfect learning language.__BR__3) Simplicity of syntax and semantics. Wrapping your head around abstract concepts can be a challenge when young. Maybe Haskell's functions are too unimaginable to grasp, or Smalltalk's object model too mired in strange syntax. Is a type system containing Integers and Floats meaningless to a child who still finds fractions puzzling?__BR__4) Finally, compiling and debugging are pains which few children are going to endure without losing interest. The requirement for code to run within the browser, I believe, is paramount: no installation, no mangled libraries and dependencies. Instead it can be run on a school computer just as easily as it can at home. Codecademy has done this really nicely, and it looks like John and his team at Khan Academy have done the same.__BR__JavaScript ticks a number of boxes in my opinion. The number of tools and libraries available means children can build interesting, visual programs. Functions as first-class citizens helps introduce students to concepts within CS, and execution within the browser is a huge benefit.__BR__Nonetheless, I don't believe it has it all. Its object model makes the teaching of basic OO concepts a nightmare. Its untyped and furthermore its type coercion can cause strange behaviour (this IMO can be extremely damaging; things work then all of a sudden they don't). Operator overloading is odd. Its just too quirky! Personally I don't believe it is an appropriate first language. It does some things nicely, but I believe it leaves itself open to a lot of bad habits if left unchecked. Ultimately I believe a first language should enable the student to pick up any language they want thereafter, and feel comfortable within it. Primarily it should teach pure concepts, not syntax and style.__BR__Shameless plug, but having reached my own personal conclusion I decided to write my own language for the browser as an MSc thesis (http://joeroot.com/wardrobe/try/ | https://github.com/joeroot/wardrobe). Its still far from complete, but I think it serves as a demonstration of what I feel is important in a language. I like many was inspired by Brett Victor's talk, and thats the eventual, unmet goal for the environment. But for now my focus is on the language and implementing it within the browser. It is strongly typed (but fewer types), has first-class functions alongside a pure OO model, and less syntactic pluralism to name a few of its traits.__BR__As I said before however, programming languages are a hugely subjective topic, and I think John's project is a big step forward. Personal experience of teaching children would suggest that this looks like a far more involved experience than what is currently available.",
              "grayedOutPercent" : 0,
              "id" : "4382788",
              "reply_id" : "4382788&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "6 hours ago",
              "username" : "joeroot"
            },
            { "children" : [  ],
              "comment" : "This could easily leverage CoffeeScript or even an education-oriented language that compiles to JS, but then the students wouldn't be able to immediately turn around and build real-world apps without additional cognitive overhead.",
              "grayedOutPercent" : 0,
              "id" : "4382271",
              "reply_id" : "4382271&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "8 hours ago",
              "username" : "dpritchett"
            }
          ],
        "comment" : "This is cool and I think Javascript is a perfectly suitable first time language, but I don't think it's ideal. Too many ways of doing things, too many code organization and programming styles... it's going to be confusing for people moving beyond the courses.__BR__Still it's better than c++ or java.",
        "grayedOutPercent" : 0,
        "id" : "4382192",
        "reply_id" : "4382192&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "look_lookatme"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "I very much agree&euro; In fact a large part of learning to code is not much grab abstract principles as it is getting accustomed to the eco system: how code relies on other code, how it is organised on files, and how it gets uploaded to the internet. It would be great if this site provided the opportunity to download a set of html and js files that re-implement the result of the students&euro; a great starting point also for a teacher to talk about these issues&euro; and a way for students to walk outside the garden when they feel like it&euro;",
              "grayedOutPercent" : 0,
              "id" : "4383450",
              "reply_id" : "4383450&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "4 hours ago",
              "username" : "schrijver"
            } ],
        "comment" : "I wonder if they've added any help for transitioning out of their sandbox. I know when I first learned programming, one problem I had was taking what I learned in the classroom on Apple IIs and transitioning to using GW-Basic or QBasic at home. Transitioning from a browser-based sandbox to editing HTML and real files would probably be even worse. It might be nice if there was an easy framework they would let people download to help them create things in a more normal environment, so they don't get stuck and give up at that point.",
        "grayedOutPercent" : 0,
        "id" : "4382770",
        "reply_id" : "4382770&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "6 hours ago",
        "username" : "johntb86"
      },
      { "children" : [  ],
        "comment" : "He mentions the responsive design being really hard, and that was something I couldn't quite articulate to myself when I saw that talk a while ago... the ideas Bret Victor presented, only a handful of them are general purpose. I don't see how one could develop the timing examples he had, for instance, in a way that makes sense outside of his specific work on his 2D platform game.",
        "grayedOutPercent" : 0,
        "id" : "4382125",
        "reply_id" : "4382125&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "th0ma5"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "Granted this is certainly not JS best practices, but following best practices was not our goal here.__BR__Explaining variable assignment is much simple than explaining callbacks and/or higher order functions.__BR__On a more practical note, this is the convention that processing.js uses, and thats what we're using to render the canvas.",
              "grayedOutPercent" : 0,
              "id" : "4382757",
              "reply_id" : "4382757&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "6 hours ago",
              "username" : "phleet"
            },
            { "children" : [  ],
              "comment" : "The former is much easier to understand.",
              "grayedOutPercent" : 0,
              "id" : "4382780",
              "reply_id" : "4382780&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "6 hours ago",
              "username" : "pbreit"
            }
          ],
        "comment" : "Little nitpick: Why make the draw event handler a magic variable instead of a function which takes a function?__BR__Ie:__BR__    var draw = function() { point(random(0, 400), random(0, 400)); };as opposed to__BR__    onDraw(function() { point(random(0, 400), random(0, 400)); });AFAICT there aren't any other variables that side-effect based on what you've assigned to them.",
        "grayedOutPercent" : 0,
        "id" : "4382708",
        "reply_id" : "4382708&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "7 hours ago",
        "username" : "rabidsnail"
      },
      { "children" : [ { "children" : [ { "children" : [  ],
                    "comment" : "&#62; Of the people who are AT ALL interested in learning about programming, I have encountered exactly zero of them who aren't already excited about it.__BR__How is this tautology at all helpful?  Of course the people who are excited about programming are excited about it.  For every one of those, how many view computers as entertaining magic boxes?  Most non-programmers I know regard programming as a kind of impenetrable dark art.  There is such a monumental disconnect between \\\"Hello World\\\" and \\\"I can do whatever I want!\\\" that most people just assume that they'll never be able to achieve any meaningful result.  Being able to create something visually interesting that you can share with your friends is a big motivator, and I think you're too quick to deride it.__BR__Also, I don't get why you view this as something \\\"barely worth learning.\\\"  The \\\"real world\\\" doesn't run on Turbo Pascal anymore, and Javascript, like it or not, is a big part of modern programming.  Do you really think it will be so difficult to translate skills acquired generating interesting games into skills that can be used in a modern web shop?__BR__Anyway, you're welcome to your opinion, I just personally don't understand it.  Luckily for people that share your opinion, there are plenty of traditional CS resources all over the web and elsewhere to learn programming in the \\\"real world.\\\"  For those whose \\\"real world\\\" consists of playing games and wondering how they work, this might just be the thing that motivates them to look under the hood.",
                    "grayedOutPercent" : 0,
                    "id" : "4383567",
                    "reply_id" : "4383567&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "3 hours ago",
                    "username" : "yusefnapora"
                  } ],
              "comment" : "\\\"Reducing the complexity of getting started down to zero will result in more people learning.\\\"__BR__Yes, but you're removing NECESSARY complexity, in order for them to learn something barely worth learning.__BR__\\\"I feel that purely textual coding environments (or coding environments that favor textual output over visual output) serve as a highly uninteresting introduction to programming.\\\"__BR__There are people who get to use non-textual coding environments, and there are people who get to work with very visual outputs.  I feel that by giving them these tools, you've castrated their ability to understand anything meaningful.__BR__\\\"Obviously, right now we&euro;&trade;re not teaching very much in the way of traditional Computer Science content,\\\"__BR__Yeah, approximately none of it.__BR__\\\"We decided that it was much more fruitful for us to tackle the most challenging problem that exists with Computer Science education first: Getting people excited about programming.\\\"__BR__Of the people who are AT ALL interested in learning about programming, I have encountered exactly zero of them who aren't already excited about it.  Why do you think that GETTING them excited is the \\\"most challenging problem\\\"?__BR__I absolutely applaud the effort, and I sincerely wish you success.__BR__I just personally think you're doing it all wrong.",
              "grayedOutPercent" : 0,
              "id" : "4382747",
              "reply_id" : "4382747&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "6 hours ago",
              "username" : "VikingCoder"
            },
            { "children" : [ { "children" : [  ],
                    "comment" : "\\\"I absolutely applaud the effort, and I sincerely wish you success.\\\"__BR__I wish all trolls applauded effort and wished people success.__BR__I may not be expressing it well, but I honestly think calling this \\\"Computer Science\\\" is absurd.  Feel free to call people who disagree with you a troll any time it's more convenient than actually having a conversation with them.__BR__I wish we could discuss the wild success of One Laptop Per Child, which tried a similar approach.  But we can't.  And I personally believe it's because of this \\\"tinker-toy hand's on\\\" approach that One Laptop Per Child has failed so spectacularly.  I fear that this approach will shove Khan Academy's \\\"Computer Science\\\" section into a similar footnote of history.__BR__I also think all of this is too important to do wrong, so it pisses me off to see a group so prominent make such a misstep.",
                    "grayedOutPercent" : 0,
                    "id" : "4382877",
                    "reply_id" : "4382877&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "6 hours ago",
                    "username" : "VikingCoder"
                  } ],
              "comment" : "PSA: Don't feed the troll.",
              "grayedOutPercent" : 0,
              "id" : "4382828",
              "reply_id" : "4382828&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "6 hours ago",
              "username" : "dudey"
            }
          ],
        "comment" : "I am done with all of you so-called \\\"hands-on people\\\" who don't give people real tools to use.__BR__The XO (One Laptop Per Child) and now this.__BR__Please stop giving people tinker-toy environments with tinker-toy problems that have nothing to do with the real world.__BR__If someone's not motivated to learn, yes, they may need this kind of hand-holding.  But if someone genuinely wants to learn to program computers for a living, this is - in my opinion - not what they need at all.__BR__Drivers Education is taught in a real car, not in Mario Kart on a Wii.  I'm sick of the Mario Kart version of computers being spoon-fed to otherwise intelligent people as though it has anything to do with reality.__BR__I learned to program using Turbo Pascal.  I was not so far removed from reality that everything I learned was almost completely useless.  I have not given this much attention yet, but so far, it feels completely useless.__BR__PLEASE correct me if I'm wrong.",
        "grayedOutPercent" : 36,
        "id" : "4382721",
        "reply_id" : "4382721&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "7 hours ago",
        "username" : "VikingCoder"
      },
      { "children" : [  ],
        "comment" : "Awesome stuff. John Resig, if you're in here, can you give any details on the challenges of instantly updating the Processing sketch? I can just wait for the blog post, but I'm really curious.__BR__Also, what components exactly are you planning to release open source? The other work in this area that I've been able to find is very tightly coupled to the rendering library (d3 or PJS). Is the Khan Academy system open to alternate rendering libraries?",
        "grayedOutPercent" : 0,
        "id" : "4382618",
        "reply_id" : "4382618&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "7 hours ago",
        "username" : "jonahkagan"
      },
      { "children" : [  ],
        "comment" : "These are good entrepreneurs and programmers, and they are using great tools, but I don't think they are qualified to say they are redefining teaching basic Computer Science.__BR__Interactive platforms and approaches have been constantly introduced by CS educators to teach introductory programming.   Educators are very aware of the value of interactivity and reactivity in teaching and learning.  The only new thing here is the utility of  cool new tools equipped with latest web-based technologies.  Further, their approach is limited to programming, which is a large part but not the only approach to Introductory Computer Science. For example, they can't touch approaches such at MIT or Rice (I think), among others, which employ cool physical robots to teach coding, thinking, programming and robotics.__BR__So this is not so much redefining, but rather a little enhancing CS education with cool tools.",
        "grayedOutPercent" : 0,
        "id" : "4383050",
        "reply_id" : "4383050&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "5 hours ago",
        "username" : "vph"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "In our experience thus far we've found that students are far less intimidated by the numbers/math when they're able to directly manipulate the results. When they can tweak the numbers with minimal ramifications and instantaneous feedback they can easily intuit what the numbers are attempting to do. Working with young kids we definitely found that they were comfortable in this environment even after minimal introduction.",
              "grayedOutPercent" : 0,
              "id" : "4382634",
              "reply_id" : "4382634&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "jeresig"
            } ],
        "comment" : "This looks really great.  One criticism is that this style of graphical programming is overwhelmingly of a mathematical bent.  Granted it's quite basic arithmetic but still, you open a code sample and you're confronted with a bunch of numbers and mathematical expressions.__BR__My worry with this is that there are many, many youngsters out there who are intimidated by math but who would absolutely love to write code.  This is especially worrisome since such a huge amount of coding involves no math at all.",
        "grayedOutPercent" : 0,
        "id" : "4382573",
        "reply_id" : "4382573&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "7 hours ago",
        "username" : "daviddaviddavid"
      },
      { "children" : [  ],
        "comment" : "Seems clear they are teaching Programming and not Computer Science. There's nothing wrong with that, but they should be upfront about it.",
        "grayedOutPercent" : 0,
        "id" : "4383755",
        "reply_id" : "4383755&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "2 hours ago",
        "username" : "warmfuzzykitten"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "Umm, I think it's all still open-sourced.  It's just hosted at Github, which probably integrates it better into the open source community:__BR__https://github.com/khan__BR__They even make their ec2 instances open source!",
              "grayedOutPercent" : 0,
              "id" : "4383247",
              "reply_id" : "4383247&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "4 hours ago",
              "username" : "jnbiche"
            },
            { "children" : [ { "children" : [ { "children" : [  ],
                          "comment" : "I think they're getting downvoted for being incorrect.__BR__I can't find any info about KA moving to closed source.",
                          "grayedOutPercent" : 0,
                          "id" : "4383366",
                          "reply_id" : "4383366&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "4 hours ago",
                          "username" : "shardling"
                        } ],
                    "comment" : "So why are these remarks getting downvoted? BTW, could someone provide links with more details, i.e. what was closed, this still appears pretty open: https://github.com/khan/khan-exercises",
                    "grayedOutPercent" : 0,
                    "id" : "4383253",
                    "reply_id" : "4383253&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "4 hours ago",
                    "username" : "schrijver"
                  } ],
              "comment" : "It's really sad. They were never really concerned with being truly free &#38; open. They just were \\\"open\\\" in the wishy-washy way that when you do anything online for free, you can call it open and get lots of support.",
              "grayedOutPercent" : 46,
              "id" : "4383179",
              "reply_id" : "4383179&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "5 hours ago",
              "username" : "TheSilentNumber"
            }
          ],
        "comment" : "It is disappointing that KA launched their Computer Science program not long after making their website closed source[0].  Doubly disappointing because of open-education projects that were using the software platform to do free education projects in Brazil[1] and Portugal[2].__BR__[0]: https://khanacademy.kilnhg.com/Auth/LogOn?ReturnUrl=/&#38;nr...[1]: https://calenglishbr.appspot.com/[2]: https://uc3m-ka.appspot.com/login?continue=http%3A%2F%2Fuc3m...",
        "grayedOutPercent" : 0,
        "id" : "4383153",
        "reply_id" : "4383153&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "5 hours ago",
        "username" : "sethish"
      },
      { "children" : [  ],
        "comment" : "This is great.  I volunteered at Maker's Faire earlier this year at the Scratch booth and a lot of parents were wondering what some possible next steps could be for their kids who were interested in learning more about programming.  It felt a little weird suggesting Khan Academy videos, but with this project I think the transition to deeper CS concepts is a lot more seamless for those who are curious",
        "grayedOutPercent" : 0,
        "id" : "4382336",
        "reply_id" : "4382336&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "jameshsi"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "http://webcache.googleusercontent.com/search?q=cache:http://...",
              "grayedOutPercent" : 0,
              "id" : "4382242",
              "reply_id" : "4382242&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "8 hours ago",
              "username" : "iyerrag"
            } ],
        "comment" : "Anyone have a cached copy? ejohn.org is returning a 500 error.",
        "grayedOutPercent" : 0,
        "id" : "4382195",
        "reply_id" : "4382195&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "sciurus"
      },
      { "children" : [  ],
        "comment" : "Was there something wrong with the old definition?",
        "grayedOutPercent" : 0,
        "id" : "4383849",
        "reply_id" : "4383849&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "1 hour ago",
        "username" : "scoith"
      },
      { "children" : [ { "children" : [  ],
              "comment" : "Vi Hart does work at Khan Academy: https://en.wikipedia.org/wiki/Vi_Hart#Khan_Academy",
              "grayedOutPercent" : 0,
              "id" : "4382490",
              "reply_id" : "4382490&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "7 hours ago",
              "username" : "dbaupp"
            },
            { "children" : [ { "children" : [ { "children" : [ { "children" : [  ],
                                "comment" : "Thanks, she is doing an amazing job",
                                "grayedOutPercent" : 0,
                                "id" : "4382711",
                                "reply_id" : "4382711&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                                "time" : "7 hours ago",
                                "username" : "eranation"
                              } ],
                          "comment" : "They are narrated by Jessica Liu (as mentioned in the blog post).",
                          "grayedOutPercent" : 0,
                          "id" : "4382472",
                          "reply_id" : "4382472&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                          "time" : "7 hours ago",
                          "username" : "jeresig"
                        } ],
                    "comment" : "I know, I talk about the actual videos, e.g. this one http://www.khanacademy.org/cs/intro-to-drawing/848372201",
                    "grayedOutPercent" : 0,
                    "id" : "4382433",
                    "reply_id" : "4382433&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
                    "time" : "8 hours ago",
                    "username" : "eranation"
                  } ],
              "comment" : "Sal Khan and John Resig are narrating the video.",
              "grayedOutPercent" : 0,
              "id" : "4382424",
              "reply_id" : "4382424&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
              "time" : "8 hours ago",
              "username" : "Encosia"
            }
          ],
        "comment" : "Love it, Who is the presenter in the videos? the voice sound really similar to Vi Hart or is it just me?",
        "grayedOutPercent" : 0,
        "id" : "4382418",
        "reply_id" : "4382418&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "eranation"
      },
      { "children" : [  ],
        "comment" : "tried it. The greatest takeaway for me is being able to edit the code and see changes live.",
        "grayedOutPercent" : 0,
        "id" : "4382185",
        "reply_id" : "4382185&whence=%69%74%65%6d%3f%69%64%3d%34%33%38%32%30%37%36",
        "time" : "8 hours ago",
        "username" : "bazookaBen"
      }
    ] }